"""
 ["172.16.3.1", “172.16.1.5”, “172.15.2.0”,
 “172.16.3.1”, “172.16.3.1”, “172.16.1.5”]
不需要定义函数，统计在此列表中每一
个ip出现的次数，并输出出现频率最高的成员
"""

ls =  ["172.16.3.1", "172.16.1.5", "172.15.2.0", "172.16.3.1", "172.16.3.1", "172.16.1.5"]
ls_1 = {} #定义一个空的字典，和一个空的列表
a = []
s = set(ls)  # 转化为集合，去除重复

for each_s in s:  

	count = 0  
	for each_l in ls:  

		if each_l == each_s:  #　遍历集合和列表，：查看重复次数
			count += 1
			a.append(count)				 

	ls_1[count] = each_s
	print("{}出现的次数是：{}".format(each_s,count))

print("<-------------------------------------------------------------->")
mymax = max(a)
print("{}出现的频率最高。".format(ls_1[mymax]))
