
#4.回答以下问题
#	1)python面向对象的特点是什么
		封装、继承、多态。

#	2)继承给我带来什么好处
		建造系统中的类避免重复，重复使用代码，减少代码量。

#	3)super关键字有什么作用
		调用父类的一个方法，解决多继承的问题。

#	4)定义类的__init__方法可以有返回值吗，自己尝试一下
		返回None

#	5)当子类定义了与父类相同的方法的时候，会怎么样
		子类方法覆盖父类方法

#	6)实例化对象的时候，类的什么方法会自动调用
		__init__方法自动调用
		
#	7)以下几天语句体现了python什么特性
#		"I love python".cont('0')
#		(1,2,3,2,1,5,6,2,9).count(2)
#		[1,2,3,2,1,2,2,4,5,6,5,5].count(5)
		动态性

#	8)python类内部的self有什么作用，需要传递此参数吗
		self代表的是类的实例，有时可以省略。

#	9)装饰器有什么作用，说说你知道的有哪些装饰器
		装时期的本质是一个Python函数，它可以让其他函数在不需要做任何代码变动的前提下增加额外功能，装饰器的返回值也是一个函数对象,重复使用代码。property，unique

#	10）python允许多继承吗，自己的代码中大量出现多继承有哪些弊端
		允许多继承。大量出现多继承统一父类被多次调用。




