'''
3.模拟一个乌龟吃小鱼的游戏
    假设游戏背景在x * y的范围内进行(0<=x<=10, 0<=y <=10)
    游戏中有1只乌龟和5条小鱼
    它们移动的方向是随机的
    乌龟每移动一次可能是1或者2(随机的),小鱼每次就移动1
    当移动的游戏背景边缘,自动向反方向移动
    乌龟的初识体能值是100
    乌龟每移动一次,体能值-1
    小鱼不增加也不消耗体能
    当乌龟和小鱼坐标重叠,就算乌龟吃掉已知小鱼,乌龟的体能值立即上升10
    当乌龟体能为0时,则乌龟死掉,game over,群鱼嘲笑"小样!还想吃我"
    如果小鱼全部被吃掉,游戏也结束!乌龟大笑"哈哈哈哈!敢惹我龟丞相"
    
提示:
    先定义乌龟类和鱼类,将乌龟和鱼类的所有的属性和方法先约定好    
'''    
import random


class Wugui(object):
	def __init__(self, x = random.randint(0,10), y = random.randint(0,10)):
		self.__x = x
		self.__y = y
		
	def __init__(self,tineng = 100)
		


























