'''组合嵌套题，有如下列表，按照要求实现每一个功能
lis = [['k',['qwe',20,{'k1':['tt',3,'1']},89],'ab']]
<1> 将列表lis中的‘tt’变成大写（两种方式）
<2> 将列表lis中数字3变成字符串‘100’（两种方式）
<3>将列表中‘1’变成数字101（两种方式）'''


lis = [['k',['qwe',20,{'k1':['tt',3,'1']},89],'ab']]


#第一种方法
l = list(lis[0][1][2].keys())
print(l[0])
#1
lis[0][1][2][l[0]] = ['TT',3,'1']
print("lis为:",lis)
#2
lis[0][1][2][l[0]] = ['tt','100','1']
print("lis为:",lis)

lis[0][1][2][l[0]] = ['tt',3,101]
print("lis为:",lis)


#第二种方法
lis = [['k',['qwe',20,{'k1':['tt',3,'1']},89],'ab']]


lis = [['k',['qwe',20,{'k1':['TT',3,'1']},89],'ab']]
print(lis)
lis = [['k',['qwe',20,{'k1':['tt','100','1']},89],'ab']]
print(lis)
lis = [['k',['qwe',20,{'k1':['TT',3,101]},89],'ab']]
print(lis)
