'''
4. 回答一下问题
   1) python面向对象的特点是什么
   继承 多态 封装
   2) 继承给我带来什么好处
   提高代码的复用性
   3) super关键字有什么作用
   父类方法仅被执行一次
   4) 定义类的__init__方法可以有返回值吗,自己尝试一下
   不需要
   5) 当子类定义了与父类相同的方法的时候,会怎么样
   父类的方法就不会被调用
   6) 实例化对象的时候,类的什么方法会自动调用
   父类的方法会自动调用
   7)一下几天语句体现了python的什么特性
         “i love python”.count('0')
        (1,2,3,2,1,5,6,2,9).count(2)
        [1,2,3,2,1,2,2,4,5,6,5,5].count(5)
    统计某一个元素出现的次数
    8) python类内部的self有什么作用,需要传递此参数吗
    代表初始化的类的实例
    9) 装饰器有什么作用,说说你知道的有哪些装饰器
    为函数增加功能  log 
   10) python允许多继承吗,自己的代码中大量出现多继承有哪些弊端
    允许
    结构复杂化  优先顺序混乱
'''
















































































